NB: Do not write queries for the questions below. Use numpy, pandas, matplotlib and searborn. The only query you should have is to join the two tables in pd.read_sql

Questions: 
1. Create a new column for selling_price that is taking a 25% markup from the original buying_price column. This should be something like new_sp = buying_price*1.25. Use this new column moving forward for selling price, not the original
2. Create a new column for profit that is now using the new_sp column. Use this new profit column moving forward.
3. Display the total sales ever made in the duka.
4. Display the top 5 products of the business, in terms of sales.
5. Display the best performing month in the business in terms of sales
6. Graph the sales of each of the products ordered. 
7. What is the correlation value between the buying_price and profit?
8. If possible, what is the correlation between product_name and profit?
9. Graph the monthly sales.
10. Clean up the unused columns like the old selling price and profit, then dump a csv file of the clean dataset. Ensure the output is called duka_sales_cleaned.csv

In [5]:
# install pandas and import the package(s)
import pandas as pd

In [6]:
# install sqlalchemy
from sqlalchemy import create_engine as ce

In [7]:
#connect to db
engine=ce("postgresql://postgres:Mamamia11@localhost:5432/myduka")

In [10]:
#select all from products
df=pd.read_sql("select * from products",engine)

In [11]:
#display the results
df.head()

   id       name  buying_price  selling_price  stock_quantity
0   1   blueband         200.0          210.0              50
1   2       kiwi         150.0          170.0              50
2   3  broadways          60.0           70.0              50
3   4  superloaf          55.0           65.0              50
4   5     lotion         200.0          250.0              50

In [15]:
#add a new column with the new buying price
df['new_sp']=df['buying_price']*1.25

In [16]:
#display the results
df.head()

   id       name  buying_price  selling_price  stock_quantity  new_sp
0   1   blueband         200.0          210.0              50  250.00
1   2       kiwi         150.0          170.0              50  187.50
2   3  broadways          60.0           70.0              50   75.00
3   4  superloaf          55.0           65.0              50   68.75
4   5     lotion         200.0          250.0              50  250.00